{
    "en": {
        "hero-title": "Transform Your Space with Timeless Furniture",
        "hero-subtitle": "Designed to fit your life, not just your space",
        "hero-button": "Explore now",
        "premium-title": "Premium furniture - Elegant & Modern Living",
        "premium-content": "Transform your home into a sanctuary of comfort and style with our premium designs and exquisite craftsmanship — a true reflection of your personal taste.",
        "new1": "A new living furniture set bring the air and nature from afar to your home",
        "new2": "A cozy lifestyle waiting for you at home in the cold winter",
        "new3": "A focus space where plants bath in your 'knowledge'",
        "new4": "Dinner? Yes, it is the time for gathering and eat delicious fresh food",
        "new5": "Surrounded by the color of nature, make you feel nothing much than a jungle in your home",
        "new6": "A simple reading table with comfort chair for you to explore the world of adventure",
        "Why-Choose-Us": "Why choose us",
        "wcu-content": "Discover timeless furniture crafted with care and designed to last",
        "reason1": "Premium Quality Materials",
        "reason1-content": "We use only the finest, sustainably sourced materials to create furniture that stands the test of time — durable, safe, and full of character.",
        "reason2": "Styles for Every Space",
        "reason2-content": "From cozy apartments to spacious villas, our versatile designs fit perfectly into any home — blending modern comfort with timeless aesthetics.",
        "reason3": "Designed for Daily Life",
        "reason3-content": "Our pieces aren't just for show — they're made for real life. Enjoy durable, comfortable furniture that complements your everyday routine.",
        "reason4": "Thoughtful Craftsmanship",
        "reason4-content": "Every detail matters. From smooth finishes to seamless joints, each piece is carefully crafted to bring both function and beauty to your home.",
        "product": "Explore Our Collections",
        "product-content": "that reflects your personal style with our exclusive furniture collections",
        "table": "Table",
        "bed": "Bed",
        "couch": "Couch",
        "wardrobe": "Wardrobe",
        "reviews": "Our Customer Reviews",
        "reviews-content": "It's such an honour of us to bring our customers well-qualified experiences",
        "review1": "I was truly impressed with the wide range of furniture available here. The designs are elegant, and the quality feels premium. The staff was attentive. I'll definitely come back again.",
        "review2": "This store offers outstanding furniture at reasonable prices. The materials are durable, and the finishing is excellent. Delivery was on time. My home now feels warmer and more stylish thanks to their products.",
        "review3": "Shopping here was a wonderful experience. The showroom is beautifully arranged. I appreciate the honest advice from the staff and the flawless delivery process.",
        "about-title": "The Meaning Behind Our Name",
        "about-p1": "Symbolizing nature, growth, and renewal",
        "about-p2": "Representing craftsmanship and functionality",
        "about-p3": "The heart of comfort and belonging",
        "about-tagline": "We bring nature's harmony into your home through thoughtfully crafted furniture that grows with your life.",
        "faq-title": "Frequently Asked Questions",
        "faq-subtitle": "Everything you need to know about our furniture and services",
        "faq-q1": "How long does delivery take?",
        "faq-a1": "Standard delivery takes 5-7 business days within the city. For remote areas, it may take up to 10-14 days. We also offer express delivery for urgent orders.",
        "faq-q2": "What is your warranty policy?",
        "faq-a2": "All our furniture comes with a 2-year warranty covering manufacturing defects. We also offer extended warranty options up to 5 years for selected products.",
        "faq-q3": "Can I customize furniture designs?",
        "faq-a3": "Yes! We offer customization services including fabric choices, dimensions, and finishes. Contact our design team to discuss your specific requirements.",
        "faq-q4": "What payment methods do you accept?",
        "faq-a4": "We accept cash, bank transfer, credit/debit cards (Visa, Mastercard), and installment payments through our partner banks. Online payment is also available.",
        "faq-q5": "Do you offer assembly services?",
        "faq-a5": "Yes, professional assembly service is included free for all orders. Our team will set up your furniture and remove all packaging materials."
    },

    "vi": {
        "hero-title": "Biến Đổi Không Gian Của Bạn Với Nội Thất Vượt Thời Gian",
        "hero-subtitle": "Thiết kế phù hợp với cuộc sống của bạn, không chỉ là không gian",
        "hero-button": "Khám phá ngay",
        "premium-title": "Nội thất cao cấp - Sống sang trọng & Hiện đại",
        "premium-content": "Biến ngôi nhà của bạn thành nơi thánh thiện của sự thoải mái và phong cách với thiết kế cao cấp và tay nghề tinh xảo — phản ánh chân thực gu thẩm mỹ cá nhân của bạn.",
        "new1": "Bộ nội thất phòng khách mới mang không khí và thiên nhiên từ xa đến ngôi nhà của bạn",
        "new2": "Một lối sống ấm cúng đang chờ bạn tại nhà trong mùa đông lạnh giá",
        "new3": "Không gian tập trung nơi cây cối được tắm mình trong 'tri thức' của bạn",
        "new4": "Bữa tối? Đúng vậy, đây là thời gian để sum họp và thưởng thức những món ăn tươi ngon",
        "new5": "Được bao quanh bởi màu sắc của thiên nhiên, khiến bạn cảm thấy như đang ở trong rừng nhiệt đới",
        "new6": "Một chiếc bàn đọc sách đơn giản với ghế thoải mái để bạn khám phá thế giới phiêu lưu",
        "Why-Choose-Us": "Tại sao chọn chúng tôi",
        "wcu-content": "Khám phá nội thất vượt thời gian được chế tác tỉ mỉ và thiết kế để bền lâu",
        "reason1": "Vật Liệu Chất Lượng Cao Cấp",
        "reason1-content": "Chúng tôi chỉ sử dụng những vật liệu tốt nhất, có nguồn gốc bền vững để tạo ra nội thất vượt qua thử thách thời gian — bền bỉ, an toàn và đầy cá tính.",
        "reason2": "Phong Cách Cho Mọi Không Gian",
        "reason2-content": "Từ căn hộ nhỏ ấm cúng đến biệt thự rộng rãi, các thiết kế đa dạng của chúng tôi phù hợp hoàn hảo với mọi ngôi nhà — kết hợp sự thoải mái hiện đại với thẩm mỹ vượt thời gian.",
        "reason3": "Thiết Kế Cho Cuộc Sống Hàng Ngày",
        "reason3-content": "Sản phẩm của chúng tôi không chỉ để trưng bày — chúng được làm cho cuộc sống thực tế. Tận hưởng nội thất bền bỉ, thoải mái bổ sung cho thói quen hàng ngày của bạn.",
        "reason4": "Tay Nghề Chế Tác Tỉ Mỉ",
        "reason4-content": "Mọi chi tiết đều quan trọng. Từ lớp hoàn thiện mịn màng đến các mối nối liền mạch, mỗi sản phẩm được chế tác cẩn thận để mang lại cả chức năng và vẻ đẹp cho ngôi nhà của bạn.",
        "product": "Khám Phá Bộ Sưu Tập Của Chúng Tôi",
        "product-content": "phản ánh phong cách cá nhân của bạn với các bộ sưu tập nội thất độc quyền",
        "table": "Bàn",
        "bed": "Giường",
        "couch": "Ghế Sofa",
        "wardrobe": "Tủ Quần Áo",
        "reviews": "Đánh Giá Của Khách Hàng",
        "reviews-content": "Thật vinh dự khi chúng tôi mang đến cho khách hàng những trải nghiệm chất lượng",
        "review1": "Tôi thực sự ấn tượng với sự đa dạng của nội thất ở đây. Các thiết kế thanh lịch và chất lượng cao cấp. Nhân viên chu đáo. Tôi chắc chắn sẽ quay lại.",
        "review2": "Cửa hàng này cung cấp nội thất xuất sắc với giá cả hợp lý. Vật liệu bền bỉ và hoàn thiện tuyệt vời. Giao hàng đúng giờ. Nhà tôi giờ cảm thấy ấm áp và phong cách hơn nhờ sản phẩm của họ.",
        "review3": "Mua sắm ở đây là trải nghiệm tuyệt vời. Showroom được sắp xếp đẹp mắt. Tôi đánh giá cao lời khuyên chân thành từ nhân viên và quy trình giao hàng hoàn hảo.",
        "about-title": "Ý Nghĩa Tên Của Chúng Tôi",
        "about-p1": "Tượng trưng cho thiên nhiên, sự phát triển và đổi mới",
        "about-p2": "Đại diện cho tay nghề thủ công và tính năng",
        "about-p3": "Trái tim của sự thoải mái và thuộc về",
        "about-tagline": "Chúng tôi mang sự hài hòa của thiên nhiên vào ngôi nhà của bạn thông qua nội thất được chế tác tỉ mỉ, phát triển cùng cuộc sống của bạn.",
        "faq-title": "Câu Hỏi Thường Gặp",
        "faq-subtitle": "Mọi thông tin bạn cần biết về nội thất và dịch vụ của chúng tôi",
        "faq-q1": "Giao hàng mất bao lâu?",
        "faq-a1": "Giao hàng tiêu chuẩn mất 5-7 ngày làm việc trong nội thành. Với khu vực xa, có thể mất đến 10-14 ngày. Chúng tôi cũng cung cấp dịch vụ giao hàng nhanh cho đơn hàng gấp.",
        "faq-q2": "Chính sách bảo hành như thế nào?",
        "faq-a2": "Tất cả nội thất của chúng tôi đều có bảo hành 2 năm cho lỗi sản xuất. Chúng tôi cũng cung cấp tùy chọn bảo hành mở rộng lên đến 5 năm cho các sản phẩm được chọn.",
        "faq-q3": "Tôi có thể tùy chỉnh thiết kế nội thất không?",
        "faq-a3": "Có! Chúng tôi cung cấp dịch vụ tùy chỉnh bao gồm lựa chọn vải, kích thước và hoàn thiện. Liên hệ với đội ngũ thiết kế của chúng tôi để thảo luận yêu cầu cụ thể của bạn.",
        "faq-q4": "Bạn chấp nhận phương thức thanh toán nào?",
        "faq-a4": "Chúng tôi chấp nhận tiền mặt, chuyển khoản, thẻ tín dụng/ghi nợ (Visa, Mastercard), và thanh toán trả góp qua các ngân hàng đối tác. Thanh toán trực tuyến cũng có sẵn.",
        "faq-q5": "Bạn có cung cấp dịch vụ lắp ráp không?",
        "faq-a5": "Có, dịch vụ lắp ráp chuyên nghiệp được bao gồm miễn phí cho tất cả đơn hàng. Đội ngũ của chúng tôi sẽ lắp đặt nội thất và dọn dẹp toàn bộ bao bì."
    }
}